{
  "Name": "Homemade Pasta (untried)",
  "Cooking time": "2 hrs",
  "Servings": "5",
  "Description": "",
  "Ingredients": {
    "Produce": [
      "basil",
      "garlic (6cL)",
      "onion (half)"
    ],
    "Dairy": [
      "eggs(8)",
      "parmesan cheese"
    ],
    "Meat": [
      "spicy ground prok (1lb)"
    ],
    "Spices": [],
    "Other": [
      "flour (2cups)",
      "olive oil (1tbs)"
    ]
  },
  "Steps": [
    "On a clean, sturdy work surface, turn out your chosen flour(s) and salt and make a large well in the middle with your hands.",
    "Whisk the eggs, egg yolks, and olive oil together in a medium bowl until combined, then pour the mixture into the well.",
    "Using the same fork, whisk the eggs, slowly incorporating more and more flour into the eggs by moving your fork along the edges of the well.",
    "Once almost all of the flour is incorporated, start bringing the dough together with your hands. (The dough should be malleable, but not sticky--add more flour if the dough is sticking too much to your hands or the surface. Alternatively, if it’s too dry and tough, whisk another egg with 1 tablespoon of water and use your hand to sprinkle some of the mixture over the dough, continuing to do so until the dough is easier to knead.)",
    "Knead the dough for 7-10 minutes, until the dough is smooth and elastic. When you poke the dough, it should spring back.",
    "Wrap the dough in plastic wrap and let rest at room temperature for 30 minutes to an hour, or until the dough does not spring back when poked.",
    "Unwrap the dough and cut into 8 equal pieces so that it’s easier to work with. Take 1 piece and wrap the rest in the plastic wrap so that they don’t dry out.",
    "Lightly flour your work surface, and begin rolling out the piece of dough into one long piece. Then, fold the top third down, and the bottom third over that, like a letter. Rotate the dough 90˚ and roll the piece back into a long shape. This helps form a more even rectangular shape and makes the dough a little bit easier to work with.",
    "Continue rolling out the dough until it is very thin. When you lift the dough, you should be able to see your hands through it.",
    "Fold the top and bottom of the rectangle to meet in the middle, then fold over again--this will make the dough easier to cut. Cut the dough to your ideal shape. Loosen or unravel the cut dough immediately, so it doesn’t stick, sprinkle with a bit of extra flour, or semolina, if using. Let the pasta sit out for about 30 minutes to dry out slightly.",
    "Bring a large pot of heavily salted water to a boil. Add the pasta and stir to ensure it doesn’t clump. Cook for 2-3 minutes, or 30 seconds to 1 minute after the pasta comes to the surface (fresh pasta will cook much faster than dried pasta!)",
    "Take out a noodle and taste for doneness. Once cooked to your liking, remove the pasta from the water, being sure to save at least 1 cup (240 ML) of the pasta cooking water.",
    "Add the cooked pasta into your preferred sauce and stir to coat, adding some of the reserved pasta water if needed to add a bit of body and silkiness to the sauce. "
  ],
  "Notes": [
    "2020-05-03 awesomely tasty, cooked for 2 minutes. "
  ]
}