{
  "Name": "fougasse ",
  "Cooking time": "0",
  "Servings": "3",
  "Description": "",
  "Ingredients": {
    "Produce": [
      "pitted oil cured black olives (3oz)",
      "pitted green olives (3oz)",
      "pitted kalamata olives (3oz)",
      "thyme (3 branches)",
      "lemon(1",
      "optional)"
    ],
    "Dairy": [],
    "Meat": [],
    "Spices": [
      "Herbes de provence (1/4 tsp optional)"
    ],
    "Other": [
      "all purpose flour (700g)",
      "fine semolina (30g)",
      "instant yeast (2.5g)"
    ]
  },
  "Steps": [
    "Combine water and fresh yeast first and add flour, semolina and salt.",
    "Mix on low speed for 2 min. Scrap down sides of the bowl and paddle – mix for an additional 2 minutes on low (4 min total). ",
    "The internal dough temperature should be at 80/86ºF (27/30ºC). ",
    "Cover and let the first fermentation going for an hour. Using the hook attachment now, throw in olive mixture and mix on low for 10 sec (first punch down / do not over work). ",
    "Cover and let rest for another hour. ",
    "Transfer dough onto floured worked surface; degase and round out. Place dough back in the mixer bowl, cover and let ferment for another hour (3 hours fermentation total). ",
    "Transfer fougasse dough onto a floured work surface – Divide into 3 equal portions or 6 (for smaller fougasse). ",
    "Shape into rounds (not too tight) and bench rest for 20 min (covered). ",
    "Shape each rounds into rectangular slab. Arrange onto lightly floured flax linen baker’s couche or fragrance free kitchen towels. Cover and let proof for about an hour. ",
    "",
    "Preheat oven with a pizza stone to 550ºF (290ºC) / set to conventional baking. Depending on the size of the pizza stone; bake bread in 2 batches. Place hot pizza stone on the stove. ",
    "Dust semolina onto the stone and bread. ",
    "Slash each flat bread and transfer bread onto hot stone stretching out dough to open it.",
    " Spray water on the bread to create steam and bake for 15 minutes. Transfer hot fougasse onto cooling rack and brush out olive oil – cool to room temperature. Enjoy!"
  ],
  "Notes": []
}